/**
 * Что такое ООП, расскажите, что вы знаете о ООП
 */
public class Task7 {
    /*
    Объектно-ориентированное программирование - это метод программирования, в котором главными элементами програмы являются объекты.
    ООП основывается на трех основных принципах: инкапсуляция, наследование и полиморфизм.
    С недавних пор выделяют еще и четвертый принцип - абстракцию.
    Инкапсуляция - принцип, который повзоляет объединять данные и методы; необходим для сокрытия данных от пользователя.
    Наследование - принцип, позволяющий описать новый класс (потомок) на основе существующего (базового) с полным или частичным
    использованием его функциональности.
    Полиморфизм - возможность использовать объекты с одинаковым интерфейсом, что снижает сложность программы.
    Абстракция - обобщение значимых данных и методов объекта.
     */
}
